Tester_code.ipynb

{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "32b71edd",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Paso 1: Imports\n",
    "import os\n",
    "import sys\n",
    "\n",
    "sys.path.append(os.path.abspath(\"app\"))\n",
    "from app.generador_facturas import TokenSignManager, FacturadorMonotributista\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "ab3a5814",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Paso 2: Definir parámetros del certificado\n",
    "cuit_emisor = 20412219652  # Reemplazar con tu CUIT real\n",
    "# Guardar con \"\"\" \"\"\" manteniendo las lineas originales\n",
    "cert_content = \"\"\"-----BEGIN CERTIFICATE-----\n",
    "MIIDTjCCAjagAwIBAgIIZKAbBhSLZ5EwDQYJKoZIhvcNAQENBQAwODEaMBgGA1UEAwwRQ29tcHV0\n",
    "YWRvcmVzIFRlc3QxDTALBgNVBAoMBEFGSVAxCzAJBgNVBAYTAkFSMB4XDTI1MDUxNTIwMjU1MVoX\n",
    "DTI3MDUxNTIwMjU1MVowNDEXMBUGA1UEAwwORmFjdHVyYWRvclRlc3QxGTAXBgNVBAUTEENVSVQg\n",
    "MjA0MTIyMTk2NTIwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQDBtJi7yI8is2JEEgoP\n",
    "pLDZGdUdVAPDmTFjoSID/nPReMDtKB0VK6K90I3QuUI3UgEWUL+kS4wzFjWSkH4uIom/jKCpo1Ht\n",
    "c0rMp1ucV3pXJ1ryefhMPIC+hWiJrE2KjM5O944G1zqZOaCmzyA7MtU6/fJFuIbIQzLPU771Ttu+\n",
    "ug5Efe0BE+hKFaSBmASbx1O1H4uDNoA1a2VEqhTNK84fc22JJnw+AiymliKi3Y2o9ehd+7ByFrfe\n",
    "D9/j9yq6M2XlGzX/LZpZtM7AzmKcPnBYiBzc6NlkE7WG2CjrQmcbiYLZk7fNpR8eHS/7BVrzoaI4\n",
    "y/41xffmkbqC6ey4uxovAgMBAAGjYDBeMAwGA1UdEwEB/wQCMAAwHwYDVR0jBBgwFoAUs7LT//3p\n",
    "ut7eja8RIZzWIH3yT28wHQYDVR0OBBYEFFRzDExJVTxrjikDnmOoL4C8MnsZMA4GA1UdDwEB/wQE\n",
    "AwIF4DANBgkqhkiG9w0BAQ0FAAOCAQEADwNxgC7pzXvR88hBtmfsXeW/F+I8DI7/pv8Wr7wANcoP\n",
    "fuDm6aNBw/EkRFH+4jTnz36E4vtUecg/oDKCwpdSXNpxIVOXcFDlxs/flWuBZ3WEX+FutvGTDdET\n",
    "11xbzblTpdxqR1oYs+AVOttsdsKRFk9MzV9arVvUmBJ6VDdtUkVLSpeHN4sO+OElf6/L0iRNTBGq\n",
    "NC/W27y52ErJsDrOyMaaSPxogL7AXaKk9msCdWmXoDNPKHaHx9BvUbtsNEkryebfKxM+sWFAxdvS\n",
    "Byz12woivEHW7nniNNmk3Po2+teiM4JpJ8wX+HDrh3qlfL2WbvwMwLlW5pJb0tEVCGYCRg==\n",
    "-----END CERTIFICATE-----\"\"\"\n",
    "key_content = \"\"\"-----BEGIN PRIVATE KEY-----\n",
    "MIIEvgIBADANBgkqhkiG9w0BAQEFAASCBKgwggSkAgEAAoIBAQDBtJi7yI8is2JE\n",
    "EgoPpLDZGdUdVAPDmTFjoSID/nPReMDtKB0VK6K90I3QuUI3UgEWUL+kS4wzFjWS\n",
    "kH4uIom/jKCpo1Htc0rMp1ucV3pXJ1ryefhMPIC+hWiJrE2KjM5O944G1zqZOaCm\n",
    "zyA7MtU6/fJFuIbIQzLPU771Ttu+ug5Efe0BE+hKFaSBmASbx1O1H4uDNoA1a2VE\n",
    "qhTNK84fc22JJnw+AiymliKi3Y2o9ehd+7ByFrfeD9/j9yq6M2XlGzX/LZpZtM7A\n",
    "zmKcPnBYiBzc6NlkE7WG2CjrQmcbiYLZk7fNpR8eHS/7BVrzoaI4y/41xffmkbqC\n",
    "6ey4uxovAgMBAAECggEAObd9kOpsF9taaszzOYEJfs7PLOt1KalySWzgLU96pA42\n",
    "chOzQrUbSzKipvAkdkZVc5hA2gv2rNwvv0mVh1qcL7qPvqwew8FIJt2xEs8P8XsV\n",
    "As3r+Y9Hjz1CDk+MVT2qVWY25/vmhnRg1YM+59S4K1kygKrAYlh/gb5C1mYWXOgf\n",
    "ln+G6Lb0sp6o8DKzO3AxAysftv53TN739X7HIz3zcbtEFXr8mZguh0U4iiOo58KK\n",
    "T3gVmnu1Wn1SjTiI9JHuuvyTiIJ5Fn/7dm6wEzOlkUjbi475PuZADsp3ji7CQcu7\n",
    "HidjuicVqpBzXgz0DTQu6/b++nME83+hDfTvkH+uWQKBgQDfbrREWq1AoCsayfv6\n",
    "7IK/DAJ+wkExUihxdaELoHSzbSV7GINGHL6TZpmXZfNCMSjlfFfknLZtLPgklutu\n",
    "eHFkm/WMeii19l1fpL+8mXieE1ITrwqCJIQMtjDTXGt/nioh8LWUYYSkLXIkdVHi\n",
    "88il5Hs9+mOtl1HxlCjm4M6TpwKBgQDd8KQ3+bICv8JB8YG77dke+fxL9fBUQ830\n",
    "+dk5E8riaFSEdZeTVRiflSMslm6raZjffCwIDVZiCZ7M7taZcVCWw4djaF/R4lCV\n",
    "rfQKzmw4L6qOqCfc2DKZxWe6VkKnYD4xQ43Zdp37X8Ijf/sjYyGG0YcE8oAhGVPt\n",
    "YhEzmpE2OQKBgQCmdBroMYWQ98IlGwUWUsy094WEWcOnssVegXuQ5eELKu0ZX5Gs\n",
    "0g1IUs9p8xHe5jDJhnEUZ4ugmjfjSmvqyN/xTB8KoJdjuD6n2lzdbJhna41iDK2P\n",
    "dxTJQ5HsZJXRZUuOLX2ZJW1jwleewahXo7Z/oFAQRFGuKWVqzC4Mkr5TUQKBgQCZ\n",
    "yXnBX8A9r2qIDzT6Z+GfWVG9wPl7KlC4g7hFmLVpFSobbvBNIxYg3lK1PrgJBu7r\n",
    "TTuliLhmzou/LXB+esqA7ZQPCe/7m3qDfToxkr/iXwUsPNECcrz9WJB7yfH90O7H\n",
    "bCwKl+r4mG4J81CuQK6moOGSSAcI6GgDgYSx4VTl4QKBgGr1hIA+OWQrnl2Bo5h9\n",
    "AjpBLunk5GKz7mYRX6ug9q9UOfffkhPMRLc8ti0jKhqHYyvhyqBoqT4hkCgd56HC\n",
    "u3JIK6Z3RrMIRROwsaYQ9no57oeS1zc7wYJA1OmFeMtK4GJNqTRVaLZpS0KZCcVu\n",
    "NB/7fndmUUaccmS+nIQOiKHi\n",
    "-----END PRIVATE KEY-----\"\"\"\n",
    "\n",
    "# Paso 3: Instanciar el manejador\n",
    "manager = TokenSignManager(\n",
    "    cuit_emisor=cuit_emisor,\n",
    "    test=True,  # Cambiar a False si es para entorno productivo\n",
    "    cert_content=cert_content,\n",
    "    key_content=key_content,\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "65630879",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[2025-06-09 17:50:43] [INFO] ✅ Certificado y clave guardados correctamente en la base de datos.\n"
     ]
    }
   ],
   "source": [
    "# Paso 4: Ejecutar el guardado en la base de datos\n",
    "manager.guardar_cert_db()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "3bc0c834",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[2025-06-09 19:02:33] [INFO] ✅ Token válido en DB para 20412219652 (test). Expira: 2025-06-10 05:50:44\n",
      "[2025-06-09 19:02:33] [INFO] ✅ TOKEN y SIGN recuperados de DB para CUIT 20412219652\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'token': 'PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiIHN0YW5kYWxvbmU9InllcyI/Pgo8c3NvIHZlcnNpb249IjIuMCI+CiAgICA8aWQgc3JjPSJDTj13c2FhaG9tbywgTz1BRklQLCBDPUFSLCBTRVJJQUxOVU1CRVI9Q1VJVCAzMzY5MzQ1MDIzOSIgZHN0PSJDTj13c2ZlLCBPPUFGSVAsIEM9QVIiIHVuaXF1ZV9pZD0iMTM0MzIxMDI4OSIgZ2VuX3RpbWU9IjE3NDk1MDIxODQiIGV4cF90aW1lPSIxNzQ5NTQ1NDQ0Ii8+CiAgICA8b3BlcmF0aW9uIHR5cGU9ImxvZ2luIiB2YWx1ZT0iZ3JhbnRlZCI+CiAgICAgICAgPGxvZ2luIGVudGl0eT0iMzM2OTM0NTAyMzkiIHNlcnZpY2U9IndzZmUiIHVpZD0iU0VSSUFMTlVNQkVSPUNVSVQgMjA0MTIyMTk2NTIsIENOPWZhY3R1cmFkb3J0ZXN0IiBhdXRobWV0aG9kPSJjbXMiIHJlZ21ldGhvZD0iMjIiPgogICAgICAgICAgICA8cmVsYXRpb25zPgogICAgICAgICAgICAgICAgPHJlbGF0aW9uIGtleT0iMjA0MTIyMTk2NTIiIHJlbHR5cGU9IjQiLz4KICAgICAgICAgICAgPC9yZWxhdGlvbnM+CiAgICAgICAgPC9sb2dpbj4KICAgIDwvb3BlcmF0aW9uPgo8L3Nzbz4K',\n",
       " 'sign': 'aNjLJoMVMXbWvLpOEQE+hsE5RzVcN6HJ+/elLmQhyb3QFdAS6D6codj/1J/I54+rSqrt4xWycVx+2yyyLIM9H1m0mIzSInWdA5UfuembiLjYqtkp687jHOt6YIOVNg3Xm/rSXmN6dFqthGL2XNg51b/ZsvDvkLkJDMdZarhwjxo=',\n",
       " 'expiration': datetime.datetime(2025, 6, 10, 5, 50, 44)}"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Chequear si hay TA o generar uno nuevo\n",
    "result_dict = manager.obtener_token_sign()\n",
    "result_dict"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "5966cf3f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[2025-06-09 19:02:40] [DEBUG] 📦 SOAP Request:\n",
      "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n",
      "                        <soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\n",
      "                                        xmlns:ar=\"http://ar.gov.afip.dif.FEV1/\">\n",
      "                        <soapenv:Header/>\n",
      "                        <soapenv:Body>\n",
      "                                <ar:FECAESolicitar>\n",
      "                                        <ar:Auth>\n",
      "                                                <ar:Token>PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiIHN0YW5kYWxvbmU9InllcyI/Pgo8c3NvIHZlcnNpb249IjIuMCI+CiAgICA8aWQgc3JjPSJDTj13c2FhaG9tbywgTz1BRklQLCBDPUFSLCBTRVJJQUxOVU1CRVI9Q1VJVCAzMzY5MzQ1MDIzOSIgZHN0PSJDTj13c2ZlLCBPPUFGSVAsIEM9QVIiIHVuaXF1ZV9pZD0iMTM0MzIxMDI4OSIgZ2VuX3RpbWU9IjE3NDk1MDIxODQiIGV4cF90aW1lPSIxNzQ5NTQ1NDQ0Ii8+CiAgICA8b3BlcmF0aW9uIHR5cGU9ImxvZ2luIiB2YWx1ZT0iZ3JhbnRlZCI+CiAgICAgICAgPGxvZ2luIGVudGl0eT0iMzM2OTM0NTAyMzkiIHNlcnZpY2U9IndzZmUiIHVpZD0iU0VSSUFMTlVNQkVSPUNVSVQgMjA0MTIyMTk2NTIsIENOPWZhY3R1cmFkb3J0ZXN0IiBhdXRobWV0aG9kPSJjbXMiIHJlZ21ldGhvZD0iMjIiPgogICAgICAgICAgICA8cmVsYXRpb25zPgogICAgICAgICAgICAgICAgPHJlbGF0aW9uIGtleT0iMjA0MTIyMTk2NTIiIHJlbHR5cGU9IjQiLz4KICAgICAgICAgICAgPC9yZWxhdGlvbnM+CiAgICAgICAgPC9sb2dpbj4KICAgIDwvb3BlcmF0aW9uPgo8L3Nzbz4K</ar:Token>\n",
      "                                                <ar:Sign>aNjLJoMVMXbWvLpOEQE+hsE5RzVcN6HJ+/elLmQhyb3QFdAS6D6codj/1J/I54+rSqrt4xWycVx+2yyyLIM9H1m0mIzSInWdA5UfuembiLjYqtkp687jHOt6YIOVNg3Xm/rSXmN6dFqthGL2XNg51b/ZsvDvkLkJDMdZarhwjxo=</ar:Sign>\n",
      "                                                <ar:Cuit>20412219652</ar:Cuit>\n",
      "                                        </ar:Auth>\n",
      "                                        <ar:FeCAEReq>\n",
      "                                                <ar:FeCabReq>\n",
      "                                                        <ar:CantReg>1</ar:CantReg>\n",
      "                                                        <ar:PtoVta>1</ar:PtoVta>\n",
      "                                                        <ar:CbteTipo>11</ar:CbteTipo>\n",
      "                                </ar:FeCabReq>\n",
      "                                <ar:FeDetReq>\n",
      "                                <ar:FECAEDetRequest>\n",
      "                                        <ar:Concepto>1</ar:Concepto>\n",
      "                                        <ar:DocTipo>99</ar:DocTipo> \n",
      "                                        <ar:DocNro>0</ar:DocNro>\n",
      "                                        <ar:CbteDesde>18</ar:CbteDesde>\n",
      "                                        <ar:CbteHasta>18</ar:CbteHasta>\n",
      "                                        <ar:CbteFch>20250609</ar:CbteFch>\n",
      "                                        <ar:ImpTotal>1000</ar:ImpTotal>\n",
      "                                        <ar:ImpTotConc>0.00</ar:ImpTotConc>\n",
      "                                        <ar:ImpNeto>1000</ar:ImpNeto>\n",
      "                                        <ar:ImpOpEx>0.00</ar:ImpOpEx>\n",
      "                                        <ar:ImpIVA>0.00</ar:ImpIVA>\n",
      "                                        <ar:ImpTrib>0.00</ar:ImpTrib>\n",
      "                                        <ar:FchServDesde></ar:FchServDesde>\n",
      "                                        <ar:FchServHasta></ar:FchServHasta>\n",
      "                                        <ar:FchVtoPago></ar:FchVtoPago>\n",
      "                                        <ar:MonId>PES</ar:MonId>\n",
      "                                        <ar:MonCotiz>1</ar:MonCotiz>\n",
      "                                        <ar:CondicionIVAReceptorId>5</ar:CondicionIVAReceptorId> \n",
      "                                        <ar:CanMismoMonedaExt>N</ar:CanMismoMonedaExt> \n",
      "                                </ar:FECAEDetRequest>\n",
      "                                </ar:FeDetReq>\n",
      "                                </ar:FeCAEReq>\n",
      "                                </ar:FECAESolicitar>\n",
      "                        </soapenv:Body>\n",
      "                        </soapenv:Envelope>\n",
      "                        \n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "--- Logging error ---\n",
      "Traceback (most recent call last):\n",
      "  File \"C:\\Program Files\\Python310\\lib\\logging\\__init__.py\", line 1100, in emit\n",
      "    msg = self.format(record)\n",
      "  File \"C:\\Program Files\\Python310\\lib\\logging\\__init__.py\", line 943, in format\n",
      "    return fmt.format(record)\n",
      "  File \"C:\\Program Files\\Python310\\lib\\logging\\__init__.py\", line 678, in format\n",
      "    record.message = record.getMessage()\n",
      "  File \"C:\\Program Files\\Python310\\lib\\logging\\__init__.py\", line 368, in getMessage\n",
      "    msg = msg % self.args\n",
      "TypeError: not all arguments converted during string formatting\n",
      "Call stack:\n",
      "  File \"C:\\Program Files\\Python310\\lib\\runpy.py\", line 196, in _run_module_as_main\n",
      "    return _run_code(code, main_globals, None,\n",
      "  File \"C:\\Program Files\\Python310\\lib\\runpy.py\", line 86, in _run_code\n",
      "    exec(code, run_globals)\n",
      "  File \"c:\\Users\\shern\\Desktop\\Innoview\\Facturador-AFIP\\Code\\venv_facturador\\lib\\site-packages\\ipykernel_launcher.py\", line 18, in <module>\n",
      "    app.launch_new_instance()\n",
      "  File \"c:\\Users\\shern\\Desktop\\Innoview\\Facturador-AFIP\\Code\\venv_facturador\\lib\\site-packages\\traitlets\\config\\application.py\", line 1075, in launch_instance\n",
      "    app.start()\n",
      "  File \"c:\\Users\\shern\\Desktop\\Innoview\\Facturador-AFIP\\Code\\venv_facturador\\lib\\site-packages\\ipykernel\\kernelapp.py\", line 739, in start\n",
      "    self.io_loop.start()\n",
      "  File \"c:\\Users\\shern\\Desktop\\Innoview\\Facturador-AFIP\\Code\\venv_facturador\\lib\\site-packages\\tornado\\platform\\asyncio.py\", line 211, in start\n",
      "    self.asyncio_loop.run_forever()\n",
      "  File \"C:\\Program Files\\Python310\\lib\\asyncio\\base_events.py\", line 603, in run_forever\n",
      "    self._run_once()\n",
      "  File \"C:\\Program Files\\Python310\\lib\\asyncio\\base_events.py\", line 1909, in _run_once\n",
      "    handle._run()\n",
      "  File \"C:\\Program Files\\Python310\\lib\\asyncio\\events.py\", line 80, in _run\n",
      "    self._context.run(self._callback, *self._args)\n",
      "  File \"c:\\Users\\shern\\Desktop\\Innoview\\Facturador-AFIP\\Code\\venv_facturador\\lib\\site-packages\\ipykernel\\kernelbase.py\", line 545, in dispatch_queue\n",
      "    await self.process_one()\n",
      "  File \"c:\\Users\\shern\\Desktop\\Innoview\\Facturador-AFIP\\Code\\venv_facturador\\lib\\site-packages\\ipykernel\\kernelbase.py\", line 534, in process_one\n",
      "    await dispatch(*args)\n",
      "  File \"c:\\Users\\shern\\Desktop\\Innoview\\Facturador-AFIP\\Code\\venv_facturador\\lib\\site-packages\\ipykernel\\kernelbase.py\", line 437, in dispatch_shell\n",
      "    await result\n",
      "  File \"c:\\Users\\shern\\Desktop\\Innoview\\Facturador-AFIP\\Code\\venv_facturador\\lib\\site-packages\\ipykernel\\ipkernel.py\", line 362, in execute_request\n",
      "    await super().execute_request(stream, ident, parent)\n",
      "  File \"c:\\Users\\shern\\Desktop\\Innoview\\Facturador-AFIP\\Code\\venv_facturador\\lib\\site-packages\\ipykernel\\kernelbase.py\", line 778, in execute_request\n",
      "    reply_content = await reply_content\n",
      "  File \"c:\\Users\\shern\\Desktop\\Innoview\\Facturador-AFIP\\Code\\venv_facturador\\lib\\site-packages\\ipykernel\\ipkernel.py\", line 449, in do_execute\n",
      "    res = shell.run_cell(\n",
      "  File \"c:\\Users\\shern\\Desktop\\Innoview\\Facturador-AFIP\\Code\\venv_facturador\\lib\\site-packages\\ipykernel\\zmqshell.py\", line 549, in run_cell\n",
      "    return super().run_cell(*args, **kwargs)\n",
      "  File \"c:\\Users\\shern\\Desktop\\Innoview\\Facturador-AFIP\\Code\\venv_facturador\\lib\\site-packages\\IPython\\core\\interactiveshell.py\", line 3077, in run_cell\n",
      "    result = self._run_cell(\n",
      "  File \"c:\\Users\\shern\\Desktop\\Innoview\\Facturador-AFIP\\Code\\venv_facturador\\lib\\site-packages\\IPython\\core\\interactiveshell.py\", line 3132, in _run_cell\n",
      "    result = runner(coro)\n",
      "  File \"c:\\Users\\shern\\Desktop\\Innoview\\Facturador-AFIP\\Code\\venv_facturador\\lib\\site-packages\\IPython\\core\\async_helpers.py\", line 128, in _pseudo_sync_runner\n",
      "    coro.send(None)\n",
      "  File \"c:\\Users\\shern\\Desktop\\Innoview\\Facturador-AFIP\\Code\\venv_facturador\\lib\\site-packages\\IPython\\core\\interactiveshell.py\", line 3336, in run_cell_async\n",
      "    has_raised = await self.run_ast_nodes(code_ast.body, cell_name,\n",
      "  File \"c:\\Users\\shern\\Desktop\\Innoview\\Facturador-AFIP\\Code\\venv_facturador\\lib\\site-packages\\IPython\\core\\interactiveshell.py\", line 3519, in run_ast_nodes\n",
      "    if await self.run_code(code, result, async_=asy):\n",
      "  File \"c:\\Users\\shern\\Desktop\\Innoview\\Facturador-AFIP\\Code\\venv_facturador\\lib\\site-packages\\IPython\\core\\interactiveshell.py\", line 3579, in run_code\n",
      "    exec(code_obj, self.user_global_ns, self.user_ns)\n",
      "  File \"C:\\Users\\shern\\AppData\\Local\\Temp\\ipykernel_31868\\3327903036.py\", line 15, in <module>\n",
      "    factura = facturador.emitir_factura_afip()\n",
      "  File \"c:\\Users\\shern\\Desktop\\Innoview\\Facturador-AFIP\\Code\\Facturador_ARCA_Monotributo\\app\\generador_facturas.py\", line 393, in emitir_factura_afip\n",
      "    logger.info(\"🧾 Último comprobante emitido:\", cbte_nro_anterior)\n",
      "Message: '🧾 Último comprobante emitido:'\n",
      "Arguments: (17,)\n"
     ]
    }
   ],
   "source": [
    "token = result_dict[\"token\"]\n",
    "sign = result_dict[\"sign\"]\n",
    "\n",
    "facturador = FacturadorMonotributista(\n",
    "            token,\n",
    "            sign,\n",
    "            cuit_emisor = 20412219652,\n",
    "            importe_total = 1000,\n",
    "            test = True,\n",
    "            punto_venta = 1,\n",
    "            factura_tipo = 11,\n",
    "            metodo_pago = 1,\n",
    "    )\n",
    "\n",
    "factura = facturador.emitir_factura_afip()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "4f86b807",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'cae': '75232250664713',\n",
       " 'vencimiento': '20250619',\n",
       " 'nro_comprobante': 18,\n",
       " 'fecha': '2025-06-09',\n",
       " 'qr_url': 'https://www.afip.gob.ar/fe/qr/?p=eyJ2ZXIiOiAxLCAiZmVjaGEiOiAiMjAyNS0wNi0wOSIsICJjdWl0IjogMjA0MTIyMTk2NTIsICJwdG9WdGEiOiAxLCAidGlwb0NtcCI6IDExLCAibnJvQ21wIjogMTgsICJpbXBvcnRlIjogMTAwMCwgIm1vbmVkYSI6ICJQRVMiLCAiY3R6IjogMS4wLCAidGlwb0RvY1JlYyI6IDk5LCAibnJvRG9jUmVjIjogMCwgInRpcG9Db2RBdXQiOiAiRSIsICJjb2RBdXQiOiA3NTIzMjI1MDY2NDcxM30='}"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "factura"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "venv_facturador",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
